Repository: tuxslack/xmirror
Catalog: usr/share/locale/*/LC_MESSAGES/xmirror.po
Languages: pt_br

source: Interactive script for changing XBPS mirrors
pt_br: Script interativo para alterar espelhos XBPS

source: Reset the current mirror to the default, skipping the interactive TUI.
pt_br: Redefine o espelho atual para o padrão, ignorando a TUI interativa.

source: Show this help and exit.
pt_br: Mostrar esta ajuda e sair.

source: Use an alternative mirror list file. This should be a tab-separated value file with the columns: region, url, location, tier. Default: /usr/share/xmirror/mirrors.lst
pt_br: Use um arquivo de lista de espelhos alternativo. Este deve ser um arquivo de valores separados por tabulação com as colunas: região, url, localização, nível. Padrão: /usr/share/xmirror/mirrors.lst

source: Don't attempt to update the mirror list.
pt_br: Não tente atualizar a lista de espelhos.

source: Use an alternative rootdir. Acts like xbps's -r flag.
pt_br: Use um diretório raiz alternativo. Atua como a flag -r do xbps.

source: Set the current mirror to mirrorurl and exit, skipping the interactive TUI.
pt_br: Defina o espelho atual como mirrorurl e saia, pulando a interface gráfica interativa.

source: Show the version and exit.
pt_br: Mostre a versão e saia.

source: Copyright (c) 2023 classabbyamp, released under the BSD-2-Clause license
pt_br: Copyright (c) 2023 classabbyamp, lançado sob a licença BSD-2-Clause

source: For the best experience, choose a mirror geographically close to you, or use the Fastly Global CDN (listed in %sWorld%s). To use the default mirror (%srepo-default.voidlinux.org%s), which can point to any Tier 1 mirror, Select %s%sDefault%s. Tier 1 mirrors are maintained by the Void Linux Infrastructure Team and will always have the latest packages available. Tier 2 mirrors are not managed by Void and do not have any guarantees of freshness or completeness of packages, nor are they required to sync every available architecture or sub-repository.
pt_br: Para a melhor experiência, escolha um espelho geograficamente próximo a você ou use o Fastly Global CDN (listado em %sWorld%s). Para usar o espelho padrão (%srepo-default.voidlinux.org%s), que pode apontar para qualquer espelho de Nível 1, selecione %s%sDefault%s. Os espelhos de Nível 1 são mantidos pela Equipe de Infraestrutura do Void Linux e sempre terão os pacotes mais recentes disponíveis. Os espelhos de Nível 2 não são gerenciados pelo Void e não oferecem nenhuma garantia de atualização ou integridade dos pacotes, nem são obrigados a sincronizar todas as arquiteturas ou sub-repositórios disponíveis.

source: Use UP and DOWN keys to navigate menus. Use TAB to switch between buttons and ENTER to select.
pt_br: Use as teclas PARA CIMA e PARA BAIXO para navegar pelos menus. Use TAB para alternar entre os botões e ENTER para selecionar.

source: Void Linux Mirror Selector -- https://www.voidlinux.org (v%s)
pt_br: Seletor de espelho do Void Linux -- https://www.voidlinux.org (v%s)

source: Back
pt_br: Voltar

source: could not find %s
pt_br: não foi possível encontrar %s

source: xmirror: could not find xbps-%s or xbps-%s.static
pt_br: xmirror: não foi possível encontrar xbps-%s ou xbps-%s.static

source: must be run as root
pt_br: deve ser executado como root

source: Africa
pt_br: África

source: Antarctica
pt_br: Antártica

source: Asia
pt_br: Ásia

source: Europe
pt_br: Europa

source: North America
pt_br: América do Norte

source: South and Central America
pt_br: América do Sul e Central

source: Globally Available
pt_br: Disponível globalmente

source: updating mirrorlist in %s/usr/share/xmirror
pt_br: Atualizando a lista de espelhos em %s/usr/share/xmirror

source: unable to fetch new mirror list
pt_br: não foi possível buscar a nova lista de espelhos

source: Default
pt_br: Padrão

source: Reset to the default mirror
pt_br: Redefinir para o espelho padrão

source: Exit
pt_br: Sair

source: Exit this wizard
pt_br: Sair deste assistente

source: %sThe following operations will be executed:%s\n\n The current mirror will be switched to: %s%s%s The following files in %s%s/etc/xbps.d%s will be created or overwritten, if they exist: %s%s%s\n\n %sDo you want to continue?%s
pt_br: %sAs seguintes operações serão executadas:%s\n\n O atual O espelho será alterado para: %s%s%s Os seguintes arquivos em %s%s/etc/xbps.d%s serão criados ou sobrescritos, se existirem: %s%s%s\n\n %sDeseja continuar?%s

source: Mirror successfully changed to %s!
pt_br: Espelho alterado com sucesso para %s!

source: Mirror update failed! See log above for details.
pt_br: Falha na atualização do espelho! Consulte o log acima para obter detalhes.

source: Updating mirror...
pt_br: Atualizando o espelho...

source: warning: mirror protocol not specified, assuming http://
pt_br: aviso: protocolo de espelho não especificado, assumindo http://

source: %sThe following operations will be executed:%s\n\n The current mirror will be reset to the default. The following files in %s%s/etc/xbps.d%s will be removed, if they exist: %s%s%s\n\n %sDo you want to continue?%s
pt_br: %sAs seguintes operações serão executadas:%s\n\n O espelho atual será redefinido para o padrão. Os seguintes arquivos em %s%s/etc/xbps.d%s serão removidos, se existirem: %s%s%s\n\n %sDeseja continuar?%s

source: Mirror successfully reset!
pt_br: Espelho redefinido com sucesso!

source: Mirror reset failed! See log above for details.
pt_br: Falha na redefinição do espelho! Veja o log acima para mais detalhes.

source: Resetting mirror to default...
pt_br: Redefinindo o espelho para o padrão...

source: Choose a Region
pt_br: Escolha uma região

source: Tier
pt_br: Nível

source: Choose a Mirror (Region: %s)
pt_br: Escolha um espelho (região: %s)

source: updating mirror to %s...
pt_br: atualizando o espelho para %s...

source: mirror successfully updated to %s.
pt_br: espelho atualizado com sucesso para %s.

source: mirror update failed.
pt_br: falha na atualização do espelho.

source: xmirror: resetting mirror...
pt_br: xmirror: redefinindo o espelho...

source: xmirror: mirror successfully reset.
pt_br: xmirror: espelho redefinido com sucesso.

source: xmirror: mirror reset failed.
pt_br: xmirror: falha na redefinição do espelho.

source: Void Linux Mirror Selection Wizard
pt_br: Assistente de seleção de espelho do Void Linux
